## NADILA IMAARAH 3323600015 D4 SAINS DATA TERAPAN A

In [ ]:
import pandas as pd
import numpy as np
df = pd.read_csv('ruspini.csv')
df

     x   y  label
0    4  53      1
1    5  63      1
2   10  59      1
3    9  77      1
4   13  49      1
..  ..  ..    ...
70  66  23      4
71  61  25      4
72  76  27      4
73  72  31      4
74  64  30      4

[75 rows x 3 columns]

# MEMBUAT NILAI MISSING VALUES

In [ ]:
missingrows = df.sample(7).index
df.loc[missingrows,'x'] = np.nan

df.to_csv('ruspini_missing.csv', index=False)

**ANALISIS**
disini saya mencoba untuk membuat data missing dengan cara memilih sample dulu secara acak di sini saya memiliki 7 baris secara acak. Kemudian mendapatkan index dari sampel tersebut,setelah mendapatkan indexnya kemudian dirubahlah nilai ini menjadi nilai nan dengan menggunakan fungsi di numpy yakni np.nan

# PENGISIAN NILAI MISSING VALUES

In [ ]:
import pandas as pd

# Membaca dataset dari file CSV
dataset = pd.read_csv('ruspini_missing.csv')
# Menampilkan dataset sebelum pengisian missing value
print('Dataset\n', dataset)
# Mengisi nilai yang hilang dengan rata-rata berdasarkan grup 'CLASS'
dataset = dataset.fillna(dataset.groupby('label').transform('mean'))
# Menampilkan dataset setelah pengisian missing value
print('\n\nDataset setelah pengisian missing value\n', dataset)

Dataset
        x   y  label
0    4.0  53      1
1    5.0  63      1
2   10.0  59      1
3    9.0  77      1
4    NaN  49      1
..   ...  ..    ...
70   NaN  23      4
71  61.0  25      4
72  76.0  27      4
73  72.0  31      4
74  64.0  30      4

[75 rows x 3 columns]


Dataset setelah pengisian missing value
             x   y  label
0    4.000000  53      1
1    5.000000  63      1
2   10.000000  59      1
3    9.000000  77      1
4   19.125000  49      1
..        ...  ..    ...
70  69.538462  23      4
71  61.000000  25      4
72  76.000000  27      4
73  72.000000  31      4
74  64.000000  30      4

[75 rows x 3 columns]

**ANALISIS**

disini saya akan mengisi nilai missing tadi, pertama kita haurs mengelompokkan data dulu berdasarkan label agar kita bisa mengisikan nilai nan ini berdasarkan rata rata dari masing-masing kelas, kemudian menghitung nilai rata-rata dari setiap label. Kemudian menggunakan fungsi fillna untuk mengisi nilai NaN dengan nilai rata-rata dari masing-masing label

## Mencari nilai statistikal pada atribut

In [ ]:
import pandas as pd
import numpy as np
df = pd.read_csv('ruspini.csv')
df_x= df['x']

minval = df_x.min()
maxval = df_x.max()
avgval = df_x.mean()
stdval = df_x.std()

print('nilai minimum =', minval)
print('nilai maksimum =', maxval)
print('nilai rata-rata =', avgval)
print('nilai deviasi standar =', stdval)

nilai minimum = 4
nilai maksimum = 117
nilai rata-rata = 54.88
nilai deviasi standar = 30.50252980203977

## ASSIGNMENT MEET 3 DATA TITANIC

In [ ]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
df = pd.read_csv('titanic.csv')
df.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

## Menampilkan jumlah baris dan kolom

In [ ]:
rows, cols = df.shape
print(f"Jumlah baris: {rows}, Jumlah kolom: {cols}")

Jumlah baris: 1349, Jumlah kolom: 14

## menampilkan tipe masing-masing kolom

In [ ]:
df.dtypes

pclass         int64
survived       int64
name          object
sex           object
age          float64
sibsp          int64
parch          int64
ticket        object
fare         float64
cabin         object
embarked      object
boat          object
body         float64
home.dest     object
dtype: object

## ambil dataset kolom fitur (Age, Fare), dan tampilkan

In [ ]:
data = pd.DataFrame(df,columns=['age' ,'fare'])
data.head()

       age      fare
0  29.0000  211.3375
1   0.9167  151.5500
2   2.0000  151.5500
3  30.0000  151.5500
4  25.0000  151.5500

## ambil dataset kolom kelas (Survived)

In [ ]:
data = pd.DataFrame(df,columns=['survived'])
data.head()

   survived
0         1
1         1
2         0
3         0
4         0

# PENGECEKKAN MISSING VALUES PADA KOLOM AGE

In [ ]:
print("Jumlah missing value fitur 'Age' :\n", df['age'].isna().sum())

Jumlah missing value fitur 'Age' :
 273

# PENGISIAN NILAI MISSING VALUE PADA FITUR AGE

In [ ]:
import pandas as pd
# Mengisi nilai yang hilang dalam kolom 'Age' berdasarkan rata-rata grup 'Survived'
df['age'] = df.groupby('survived')['age'].transform(lambda x: x.fillna(x.mean()))
# Menampilkan hasil setelah pengisian missing values
print("\nDataset setelah pengisian missing value:\n", df[['age', 'survived']])

Dataset setelah pengisian missing value:
             age  survived
0     29.000000         1
1      0.916700         1
2      2.000000         0
3     30.000000         0
4     25.000000         0
...         ...       ...
1344  14.500000         0
1345  30.413575         0
1346  26.500000         0
1347  27.000000         0
1348  29.000000         0

[1349 rows x 2 columns]

**ANALISIS**

sama seperti tadi dilakukan pengelompokkan dengan groupby agar bisa mengisi nilai kosong berdasarkan nilai rata-rata dari masing-masing kelas. Disini saya mengelompookan berdasarkan kolom survived, kemudian pilih kolom age untuk diisi nilai nan nya dengan

# MEMASTIKAN NILAI SUDAH TIDAK ADA YG MISSING

In [ ]:
# Menampilkan jumlah missing value setelah pengisian
print("\nJumlah missing value fitur age setelah handling missing value :\n", df['age'].isna().sum())

Jumlah missing value fitur age setelah handling missing value :
 0

# NORMALISASI

In [ ]:
import pandas as pd
import numpy as np
from sklearn.preprocessing import MinMaxScaler, StandardScaler, Normalizer

In [ ]:
df.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,2.0000,166.0,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,11.0000,166.0,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,9.4025,166.0,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S,9.4025,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,S,9.4025,166.0,"Montreal, PQ / Chesterville, ON"

In [ ]:
df.dtypes

pclass         int64
survived       int64
name          object
sex           object
age          float64
sibsp          int64
parch          int64
ticket        object
fare         float64
cabin         object
embarked      object
boat         float64
body         float64
home.dest     object
dtype: object

*Menghapus kolom selain age dan fare, dan melakukan normalisasi pada kolom age dan fare yang memiliki rentang atau yang cukup tinggi*

In [ ]:
# Daftar kolom yang akan dihapus
kolom_dihapus = ['pclass', 'survived', 'name', 'sex', 'sibsp', 'parch',
                 'ticket', 'cabin', 'embarked', 'boat', 'body', 'home.dest']
# Menghapus kolom-kolom tersebut dari DataFrame
df_norm = df.drop(columns=kolom_dihapus)
# Menampilkan hasil
print("Kolom setelah penghapusan:", df_norm.columns.tolist())
print(df_norm.head())

Kolom setelah penghapusan: ['age', 'fare']
       age      fare
0  29.0000  211.3375
1   0.9167  151.5500
2   2.0000  151.5500
3  30.0000  151.5500
4  25.0000  151.5500

*A). min-max libray*

In [ ]:
minmax_scaler = MinMaxScaler()
df_minmax = pd.DataFrame(minmax_scaler.fit_transform(df_norm), columns=df_norm.columns)
print("Normalisasi Min-Max:\n", df_minmax)

Normalisasi Min-Max:
            age      fare
0     0.361169  0.412503
1     0.009395  0.295806
2     0.022964  0.295806
3     0.373695  0.295806
4     0.311064  0.295806
...        ...       ...
1344  0.179540  0.028213
1345  0.378875  0.028213
1346  0.329854  0.014102
1347  0.336117  0.014102
1348  0.361169  0.015371

[1349 rows x 2 columns]

*A). min-max manual*

In [ ]:
df = pd.DataFrame(df_norm)
# Normalisasi manual menggunakan Min-Max Scaling
def min_max_normalize(column):
    return (column - column.min()) / (column.max() - column.min())
# Menerapkan normalisasi ke setiap kolom
df_normalized_manual = df.apply(min_max_normalize)
# Menampilkan hasil normalisasi
print("Dataset setelah normalisasi:\n", df_normalized_manual)

Dataset setelah normalisasi:
            age      fare
0     0.361169  0.412503
1     0.009395  0.295806
2     0.022964  0.295806
3     0.373695  0.295806
4     0.311064  0.295806
...        ...       ...
1344  0.179540  0.028213
1345  0.378875  0.028213
1346  0.329854  0.014102
1347  0.336117  0.014102
1348  0.361169  0.015371

[1349 rows x 2 columns]

**ANALISIS**

Metode minmax ini akan merubah skala data dari 0-1

*B). z-score atau standardscaler menggunakan library*

In [ ]:
zscore_scaler = StandardScaler()
df_zscore = pd.DataFrame(zscore_scaler.fit_transform(df_norm), columns=df_norm.columns)
print("\nNormalisasi Z-Score:\n", df_zscore)

Normalisasi Z-Score:
            age      fare
0    -0.074596  3.495574
1    -2.271560  2.325659
2    -2.186814  2.325659
3     0.003634  2.325659
4    -0.387517  2.325659
...        ...       ...
1344 -1.208935 -0.357017
1345  0.035989 -0.357017
1346 -0.270172 -0.498477
1347 -0.231056 -0.498477
1348 -0.074596 -0.485758

[1349 rows x 2 columns]

**ANALISIS**

zscore ini menormalisasi data dengan merubah nilai agar data
 memiliki mean 0 dan standar deviasi 1

*B). z-score atau standardscaler manual*

In [ ]:
df = pd.DataFrame(df_norm)
# Standardisasi Z-Score manual
def z_score_normalize(column):
    return (column - column.mean()) / column.std()
# Menerapkan standardisasi Z-Score ke setiap kolom
df_zscore_manual = df.apply(z_score_normalize)
# Menampilkan hasil standardisasi
print("Dataset setelah standardisasi Z-Score:\n", df_zscore_manual)

Dataset setelah standardisasi Z-Score:
            age      fare
0    -0.074568  3.494278
1    -2.270718  2.324797
2    -2.186003  2.324797
3     0.003633  2.324797
4    -0.387373  2.324797
...        ...       ...
1344 -1.208487 -0.356885
1345  0.035975 -0.356885
1346 -0.270071 -0.498292
1347 -0.230971 -0.498292
1348 -0.074568 -0.485578

[1349 rows x 2 columns]

Pada Tahap ini saya melakukan normalisasi dengan menggunakan z-score scaller secara manual,untuk
 memudahkanya saya membuat suatu fungsi bernama z_score_normalize.
 Output yang dihasilkan normalisasi secara manual memiliki hasil yang sedikit berbeda dengan output dengan
 normalisasi dengan bantuan library, hal ini disebabkan karena perhitungan standar deviasi, pada normalisasi
 dengan library StandardScaer () perhitungan standar deviasi menggunakan populasi, sedangkan normalisasi
 manual menggunakan library pandas, pandas ini menggunakan standar deviasi sampel, selain itu terdapat
 perbedaan dalam menangani data. Pada  StandardScaler() mengubah data ke dalam bentuk NumPy array
 sebelum melakukan perhitungan, sedangkan Pandas melakukan operasi secara kolom per kolom.

*C).sigmoidal menggunakan library*

In [ ]:
from scipy.special import expit
import pandas as pd
df = pd.DataFrame(df_norm)

df_sigmoid = df.applymap(expit)
print(df_sigmoid)

           age      fare
0     1.000000  1.000000
1     0.714369  1.000000
2     0.880797  1.000000
3     1.000000  1.000000
4     1.000000  1.000000
...        ...       ...
1344  0.999999  0.999999
1345  1.000000  0.999999
1346  1.000000  0.999272
1347  1.000000  0.999272
1348  1.000000  0.999620

[1349 rows x 2 columns]

C:\Users\nimaa\AppData\Local\Temp\ipykernel_15468\3655355922.py:5: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  df_sigmoid = df.applymap(expit)

**ANALISIS**
normalisasi sigmoidal ini menggunakan fugsi sigmoid hasilnya biasanya anatara 0 dan 1 tapi bisa mendekati 0 atau 1

*C).sigmoidal secara manual*

In [ ]:
df = pd.DataFrame(df_norm)
# Normalisasi Sigmoid manual
def sigmoid_normalize(column):
    return 1 / (1 + np.exp(-column))
# Menerapkan normalisasi Sigmoid ke setiap kolom
df_sigmoid_manual = df.apply(sigmoid_normalize)
# Menampilkan hasil normalisasi
print("Dataset setelah normalisasi Sigmoid:\n", df_sigmoid_manual)

Dataset setelah normalisasi Sigmoid:
            age      fare
0     1.000000  1.000000
1     0.714369  1.000000
2     0.880797  1.000000
3     1.000000  1.000000
4     1.000000  1.000000
...        ...       ...
1344  0.999999  0.999999
1345  1.000000  0.999999
1346  1.000000  0.999272
1347  1.000000  0.999272
1348  1.000000  0.999620

[1349 rows x 2 columns]